app/controllers/albums_controller.rb

  def create
    Album.create(params[:album])
    @albums = Album.order(:name)
---
INSERT INTO "albums" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 19 Mar 2013 18:58:57 UTC +00:00], ["name", "blah"], ["updated_at", Tue, 19 Mar 2013 18:58:57 UTC +00:00]]
SELECT "albums".* FROM "albums" ORDER BY name

  def show
      album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", "1"]]

  def filter
    album = Album.find(params[:id])
    @photos = album.photos.limit(params[:count]) #JS calls look for JS files.
  end
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1 LIMIT 2