app/controllers/photos_controller.rb

def create
photo = Photo.create(params[:photo])
  album = Album.find(params[:album_id]) #:album id was shoved into the new form so now we can find that object.
  album.photos << photo
---
INSERT INTO "photos" ("album_id", "created_at", "name", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", nil], ["created_at", Wed, 20 Mar 2013 15:47:13 UTC +00:00], ["name", ""], ["updated_at", Wed, 20 Mar 2013 15:47:13 UTC +00:00], ["url", "624105370.jpg"]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1